scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
#include <Arduino.h>
#include "SensorService.h"
#include "DevicePin.h"
#include <map>
std::map<int, DevicePin*> devicePins;
DeviceConfiguration deviceConfig;
#include <FS.h>
#include <LittleFS.h>
#include <SD.h>
#if defined(ARDUINO_ARCH_ESP8266)
#include <ESP8266HTTPClient.h>
#include <ESP8266WiFi.h>
#else
#include <HTTPClient.h>
#include <WiFi.h>
#endif
#include <ESPAsyncWebServer.h>

#include <ArduinoJson.h>
#include "ConfigSchema.h"
#include "NodeConfig.h"
#include "NodeDiscovery.h"
#include "ffs/FederatedFileSystem.h"
#include "ffs/FederatedFileSystemRoutes.h"
#include "profile_config.h"
#include "broker_client.h"
#include "provision_routes.h"
#include "wifi_provisioning.h"
#include "cluster_routes.h"
#include "udp_announcement.h"
#include "udp_runtime.h"
#include "main_globals.h"
#include "time_authority.h"
#include "unique_id_service.h"

#ifdef ENABLE_PMACHINE
#include "pmachine.h"
#include "pmachine_routes.h"
#endif

#ifdef ENABLE_CAMERA
#include "CameraService.h"
#include "camera_routes.h"
#endif

#ifdef ENABLE_DISPLAY
#include "DisplayService.h"
#ifndef DISPLAY_NO_LVGL
#include "DDLRenderer.h"
#endif
#endif

#ifdef ENABLE_AWS_IOT
#include "aws_iot_routes.h"
#endif

#ifdef ENABLE_PRINTER_SCANNER
#include "PrinterService.h"
#include "printer_routes.h"
#endif

#ifdef ENABLE_BLUETOOTH_DEVICES
#include "BluetoothService.h"
#include "bluetooth_routes.h"
#endif

#if defined(ENABLE_BLUETOOTH_AUDIO_TTS) && defined(ENABLE_BLUETOOTH_DEVICES)
#include "BluetoothAudioTtsService.h"
#endif

#ifdef ENABLE_EVENT_SCHEDULER
#include "EventScheduler.h"
#endif

String nodeName = "ESP32-VM";
NodeConfig nodeConfig;
WifiConfig wifiConfig;
ClusterConfig clusterConfig;
FederatedFileSystem federatedFS;
bool ffsUp = false;
AsyncWebServer server(80);
DevicePin* devicePin = nullptr;
int devicePinNumber = 2;
#ifdef ENABLE_CAMERA
// GPIO 5 is used by camera (Y2 data line), move relay to GPIO 12
int relayPinNumber = 12;
#else
int relayPinNumber = 5;
#endif
bool relayStateOn = false;
std::map<String, bool> serviceBusyMap;

namespace {
bool gLittleFsInitialized = false;

bool ensureLittleFsInitialized() {
    if (gLittleFsInitialized) return true;

#if defined(ARDUINO_ARCH_ESP8266)
    if (LittleFS.begin()) {
        gLittleFsInitialized = true;
        return true;
    }
#else
    if (LittleFS.begin()) {
        gLittleFsInitialized = true;
        return true;
    }
    // Retry with format to recover uninitialized/corrupt local FS on ESP32.
    if (LittleFS.begin(true)) {
        gLittleFsInitialized = true;
        return true;
    }
#endif

    return false;
}
}

#ifndef DOORBELL_BUTTON_PIN
#define DOORBELL_BUTTON_PIN 13
#endif

#ifndef DOORBELL_BUTTON_ACTIVE_LEVEL
#define DOORBELL_BUTTON_ACTIVE_LEVEL LOW
#endif

#ifndef DOORBELL_BUTTON_DEBOUNCE_MS
#define DOORBELL_BUTTON_DEBOUNCE_MS 250
#endif

#if defined(ENABLE_DOORBELL_CAMERA)
bool doorbellButtonLastReading = false;
bool doorbellButtonStablePressed = false;
unsigned long doorbellButtonLastChangeMs = 0;
unsigned long doorbellLastMotionCheckMs = 0;
#endif

#if defined(ENABLE_DOORBELL_DISPLAY)
String doorbellLastAlertType;
String doorbellLastSnapshotUrl;
unsigned long doorbellLastAlertMs = 0;
#endif

#ifdef ENABLE_PMACHINE
pmachine::PMachine pm;
#endif

const char* firmwareVersion = "2026.06.06";
const char* firmwareBuildStamp = __DATE__ " " __TIME__;
const char* deviceRole = DEVICE_ROLE;

constexpr unsigned long NODE_BEACON_ACKED_INTERVAL_MS = 60000;
constexpr unsigned long NODE_BEACON_UNACKED_INTERVAL_MS = 10000;

const char* preferredTaskType = PROFILE_PREFERRED_TASK_TYPE;
const char* firmwareTrack = FIRMWARE_TRACK;
const size_t maxMessageBytes = PROFILE_MAX_MESSAGE_BYTES;
const size_t maxConcurrentTasks = PROFILE_MAX_CONCURRENT_TASKS;

struct SupervisorProbeState {
    String name;
    String url;
    bool healthy = false;
    int lastStatusCode = -1;
    unsigned long lastCheckMs = 0;
    unsigned long okCount = 0;
    unsigned long failCount = 0;
    String lastError;
};

bool supervisorEnabled = SUPERVISOR_DEFAULT_ENABLED != 0;
bool supervisorRequireFrontend = SUPERVISOR_REQUIRE_FRONTEND != 0;
unsigned long supervisorCheckIntervalMs = SUPERVISOR_CHECK_INTERVAL_MS;
unsigned long supervisorLastRunMs = 0;
SupervisorProbeState supervisorBackendProbe;
SupervisorProbeState supervisorFrontendProbe;
String supervisorHeartbeatUrl = SUPERVISOR_HEARTBEAT_URL;
int supervisorLastHeartbeatStatusCode = -1;
unsigned long supervisorLastHeartbeatPostMs = 0;
unsigned long supervisorHeartbeatOkCount = 0;
unsigned long supervisorHeartbeatFailCount = 0;
String supervisorLastHeartbeatError;
const char* supervisorConfigPath = "/supervisor-config.json";

bool supervisorOverallHealthy();
void appendSupervisorStatus(JsonObject obj);
void announcePresence();

// Declared later in this translation unit; forward declare for early route lambdas.
extern uint16_t runtimeUdpParentPort;
extern uint16_t runtimeUdpSiblingPort;

bool parseBoolValue(const String& value) {
    return value == "1" || value.equalsIgnoreCase("true") || value.equalsIgnoreCase("yes") || value.equalsIgnoreCase("on");
}

void saveSupervisorConfig() {
    JsonDocument doc;
    doc["enabled"] = supervisorEnabled;
    doc["requireFrontend"] = supervisorRequireFrontend;
    doc["intervalMs"] = static_cast<uint32_t>(supervisorCheckIntervalMs);
    doc["backendUrl"] = supervisorBackendProbe.url;
    doc["frontendUrl"] = supervisorFrontendProbe.url;
    doc["heartbeatUrl"] = supervisorHeartbeatUrl;

    File f = LittleFS.open(supervisorConfigPath, "w");
    if (!f) {
        Serial.println("[SUPERVISOR] Failed to open config file for write");
        return;
    }

    serializeJson(doc, f);
    f.close();
}

void loadSupervisorConfig() {
    // Open in append+read mode so first boot creates the file silently
    // instead of emitting a VFS missing-file error.
    File f = LittleFS.open(supervisorConfigPath, "a+");
    if (!f) {
        Serial.println("[SUPERVISOR] Failed to open config file for read");
        return;
    }

    if (f.size() == 0) {
        f.close();
        return;
    }

    f.seek(0, SeekSet);

    JsonDocument doc;
    DeserializationError err = deserializeJson(doc, f);
    f.close();
    if (err) {
        Serial.println("[SUPERVISOR] Failed to parse config file; using defaults");
        return;
    }

