scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
int httpPostForm(const String& url, const String& body, String& responseBody, uint16_t timeoutMs = 6000) {
    HTTPClient http;
#if defined(ARDUINO_ARCH_ESP8266)
    WiFiClient postFormClient;
    if (!http.begin(postFormClient, url)) return -1;
#else
    if (!http.begin(url)) return -1;
#endif
    http.addHeader("Content-Type", "application/x-www-form-urlencoded");
    http.setTimeout(timeoutMs);
    const int code = http.POST(body);
    responseBody = (code > 0) ? http.getString() : "";
    http.end();
    return code;
}

int httpGet(const String& url, String& responseBody, uint16_t timeoutMs = 4000) {
    HTTPClient http;
#if defined(ARDUINO_ARCH_ESP8266)
    WiFiClient getClient;
    if (!http.begin(getClient, url)) return -1;
#else
    if (!http.begin(url)) return -1;
#endif
    http.setTimeout(timeoutMs);
    const int code = http.GET();
    responseBody = (code > 0) ? http.getString() : "";
    http.end();
    return code;
}

bool processClaimWithLocalIngress(
    const String& claimToken,
    const String& queuePayload,
    const String& inputQueue,
    String& processError,
    int& lastEdgeCode
) {
    const String stageUrl = "http://127.0.0.1/pmachine/edge_ingress_stage";
    String form = "inputQueue=" + percentEncode(inputQueue);
    form += "&message=" + percentEncode(queuePayload);
    form += "&runRouter=1&async=1&convertMtToXml=0";

    String stageResponse;
    const int stageCode = httpPostForm(stageUrl, form, stageResponse, 6000);
    lastEdgeCode = stageCode;
    if (stageCode < 200 || stageCode >= 300) {
        processError = String("edge stage submit failed: ") + String(stageCode) + " " + stageResponse;
        return false;
    }

    JsonDocument stageDoc;
    if (deserializeJson(stageDoc, stageResponse)) {
        processError = "edge stage submit parse failed";
        return false;
    }

    String jobId = stageDoc["jobId"] | "";
    if (jobId.length() == 0) {
        processError = "edge stage missing jobId";
        return false;
    }

    const unsigned long started = millis();
    unsigned long lastHeartbeat = 0;
    const String qmBase = trimTrailingSlash(bonecrusherConfig.queueManagerUrl);

    while (millis() - started < bonecrusherConfig.processTimeoutMs) {
        if (millis() - lastHeartbeat >= bonecrusherConfig.heartbeatMs) {
            JsonDocument hbDoc;
            hbDoc["queueName"] = bonecrusherConfig.queueName;
            hbDoc["workerId"] = bonecrusherConfig.workerId;
            hbDoc["claimToken"] = claimToken;
            hbDoc["extendMs"] = bonecrusherConfig.leaseMs;
            String hbBody;
            serializeJson(hbDoc, hbBody);
            String hbResp;
            int hbCode = httpPostJson(qmBase + "/claim/heartbeat", hbBody, hbResp, 3000);
            if (hbCode > 0) {
                bonecrusherStats.heartbeatsSent += 1;
                bonecrusherStats.lastQueueHttpCode = hbCode;
            }
            lastHeartbeat = millis();
        }

        String statusResponse;
        const int statusCode = httpGet("http://127.0.0.1/pmachine/edge_ingress_status?jobId=" + percentEncode(jobId), statusResponse, 4000);
        lastEdgeCode = statusCode;
        if (statusCode <= 0) {
            delay(150);
            continue;
        }

        JsonDocument statusDoc;
        if (deserializeJson(statusDoc, statusResponse)) {
            delay(150);
            continue;
        }

        String state = statusDoc["state"] | "";
        int innerStatus = statusDoc["statusCode"] | statusCode;
        if (state == "completed") {
            if (innerStatus >= 200 && innerStatus < 300) {
                return true;
            }
            String body = statusDoc["body"] | "";
            processError = String("edge stage failed: ") + String(innerStatus) + " " + body;
            return false;
        }

        delay(120);
    }

    processError = "edge stage timed out";
    return false;
}

void runBonecrusherWorkerIteration() {
    if (!isBonecrusherRole() || !bonecrusherConfig.enabled) return;
    if (WiFi.status() != WL_CONNECTED) return;

    const String qmBase = trimTrailingSlash(bonecrusherConfig.queueManagerUrl);

    JsonDocument claimDoc;
    claimDoc["queueName"] = bonecrusherConfig.queueName;
    claimDoc["workerId"] = bonecrusherConfig.workerId;
    claimDoc["leaseMs"] = bonecrusherConfig.leaseMs;
    String claimBody;
    serializeJson(claimDoc, claimBody);

    String claimResponse;
    bonecrusherStats.claimAttempts += 1;
    const int claimCode = httpPostJson(qmBase + "/claim", claimBody, claimResponse, 4000);
    bonecrusherStats.lastQueueHttpCode = claimCode;

    if (claimCode == 404) return; // no work
    if (claimCode < 200 || claimCode >= 300) {
        bonecrusherStats.lastError = String("claim failed ") + String(claimCode) + " " + claimResponse;
        return;
    }

    JsonDocument claimRespDoc;
    if (deserializeJson(claimRespDoc, claimResponse)) {
        bonecrusherStats.lastError = "claim response parse failed";
        return;
    }

    String claimToken = claimRespDoc["claim"]["claimToken"] | "";
    String inputQueue = claimRespDoc["claim"]["message"]["messageEnvelope"]["inputQueue"] | "";
    JsonVariant msgVariant = claimRespDoc["claim"]["message"]["message"];
    String queuePayload;
    if (msgVariant.is<const char*>()) {
        queuePayload = msgVariant.as<const char*>();
    } else {
        serializeJson(msgVariant, queuePayload);
        if (inputQueue.length() == 0) {
            inputQueue = claimRespDoc["claim"]["message"]["message"]["inputQueue"] | "";
        }
        if (queuePayload.length() == 0) {
            queuePayload = claimRespDoc["claim"]["message"]["message"].as<String>();
        }
    }

    if (inputQueue.length() == 0) {
        inputQueue = bonecrusherConfig.queueName;
    }

    if (claimToken.length() == 0 || queuePayload.length() == 0) {
        bonecrusherStats.lastError = "claim payload missing token or message";
        return;
    }

    bonecrusherStats.claimed += 1;
    bonecrusherStats.lastRunMs = millis();

    String processError;
    int edgeCode = 0;
    bool ok = processClaimWithLocalIngress(claimToken, queuePayload, inputQueue, processError, edgeCode);
    bonecrusherStats.lastEdgeHttpCode = edgeCode;

    JsonDocument finishDoc;
    finishDoc["queueName"] = bonecrusherConfig.queueName;
    finishDoc["workerId"] = bonecrusherConfig.workerId;
    finishDoc["claimToken"] = claimToken;

    if (ok) {
        JsonObject completionMeta = finishDoc["completionMeta"].to<JsonObject>();
        completionMeta["edgeHttpCode"] = edgeCode;
        completionMeta["nodeName"] = nodeName;
        String finishBody;
        serializeJson(finishDoc, finishBody);
        String finishResp;
        int finishCode = httpPostJson(qmBase + "/claim/complete", finishBody, finishResp, 4000);
        bonecrusherStats.lastQueueHttpCode = finishCode;
        if (finishCode >= 200 && finishCode < 300) {
            bonecrusherStats.completed += 1;
            bonecrusherStats.lastError = "";
        } else {
            bonecrusherStats.lastError = String("complete failed ") + String(finishCode) + " " + finishResp;
        }
        return;
    }

    finishDoc["reason"] = processError;
    finishDoc["delayMs"] = bonecrusherConfig.retryDelayMs;
    finishDoc["maxAttempts"] = bonecrusherConfig.maxAttempts;
    String failBody;
    serializeJson(finishDoc, failBody);
    String failResp;
    int failCode = httpPostJson(qmBase + "/claim/fail", failBody, failResp, 4000);
    bonecrusherStats.lastQueueHttpCode = failCode;
    bonecrusherStats.failed += 1;

    if (failCode >= 200 && failCode < 300) {
        JsonDocument failDoc;
        if (!deserializeJson(failDoc, failResp)) {
            String status = failDoc["status"] | "";
            if (status == "requeued") bonecrusherStats.requeued += 1;
            if (status == "dead-letter") bonecrusherStats.deadLettered += 1;
        }
    }
    bonecrusherStats.lastError = processError;
}

#if defined(ESP32)
void bonecrusherWorkerTask(void* param) {
    (void)param;
    for (;;) {
        runBonecrusherWorkerIteration();
        const uint32_t delayMs = bonecrusherConfig.enabled
          ? (bonecrusherConfig.pollIntervalMs > 20 ? bonecrusherConfig.pollIntervalMs : 20)
          : 1000;
        vTaskDelay(pdMS_TO_TICKS(delayMs));
    }
}

void startBonecrusherWorkerTaskIfNeeded() {
    if (!isBonecrusherRole()) return;
    if (bonecrusherWorkerTaskHandle != nullptr) return;
    constexpr uint32_t bonecrusherWorkerStackBytes = 12288;
    BaseType_t ok = xTaskCreatePinnedToCore(
        bonecrusherWorkerTask,
        "bonecrusherWorker",
        bonecrusherWorkerStackBytes,
        nullptr,
        1,
        &bonecrusherWorkerTaskHandle,
        1
    );
    if (ok != pdPASS) {
        ok = xTaskCreate(
            bonecrusherWorkerTask,
            "bonecrusherWorker",
            bonecrusherWorkerStackBytes,
            nullptr,
            1,
            &bonecrusherWorkerTaskHandle
        );
    }
    if (ok == pdPASS) {
        Serial.println("[BONECRUSHER] Worker task started");
    } else {
        Serial.println("[BONECRUSHER] Worker task failed to start");
    }
}
#endif



void notFound(AsyncWebServerRequest *request) {
    request->send(404, "text/plain", "Not found");
}

