scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
// ...existing code...

void setupWebServer() {
            // Service broker endpoint: aggregator can notify this node when a service is assigned or released
            server.on("/service-broker/announce", HTTP_POST, [](AsyncWebServerRequest *request){
                if (!request->hasParam("service", true) || !request->hasParam("busy", true)) {
                    request->send(400, "text/plain", "Missing service or busy param");
                    return;
                }
                String service = request->getParam("service", true)->value();
                bool busy = request->getParam("busy", true)->value() == "true";
                serviceBusyMap[service] = busy;
                request->send(200, "text/plain", String(service) + " set to " + (busy ? "busy" : "free"));
            });

    // Board source-of-truth node naming endpoint.
    server.on("/node/name", HTTP_POST, [](AsyncWebServerRequest *request){
        String nextName;
        if (request->hasParam("nodeName", true)) {
            nextName = request->getParam("nodeName", true)->value();
        } else if (request->hasParam("nodeName")) {
            nextName = request->getParam("nodeName")->value();
        }

        nextName.trim();
        if (nextName.length() == 0) {
            request->send(400, "application/json", "{\"error\":\"nodeName is required\"}");
            return;
        }

        nodeName = nextName;
        File f = LittleFS.open(NODE_NAME_PATH, "w");
        if (!f) {
            request->send(500, "application/json", "{\"error\":\"failed to persist nodeName file\"}");
            return;
        }
        f.print(nodeName);
        f.close();

        if (!loadNodeConfig(nodeConfig)) {
            nodeConfig = NodeConfig();
        }
        nodeConfig.nodeName = nodeName;
        saveNodeConfig(nodeConfig);

#if defined(ESP32)
        WiFi.setHostname(nodeName.c_str());
#elif defined(ESP8266)
        WiFi.hostname(nodeName.c_str());
#endif

        bonecrusherConfig.workerId = nodeName;
        udpRuntimeResetBeaconState();
        announcePresence();

        JsonDocument doc;
        doc["status"] = "ok";
        doc["nodeName"] = nodeName;
        doc["persisted"] = true;
        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    });

    // Board source-of-truth topology endpoint.
    server.on("/node/topology", HTTP_POST, [](AsyncWebServerRequest *request){
        if (!loadNodeConfig(nodeConfig)) {
            nodeConfig = NodeConfig();
        }

        if (request->hasParam("activeClusterId", true)) {
            nodeConfig.activeClusterId = request->getParam("activeClusterId", true)->value();
        }
        if (request->hasParam("parentHost", true)) {
            nodeConfig.parentHost = request->getParam("parentHost", true)->value();
        }
        if (request->hasParam("parentNodeId", true)) {
            nodeConfig.parentNodeId = request->getParam("parentNodeId", true)->value();
        }
        if (request->hasParam("isClusterGateway", true)) {
            nodeConfig.isClusterGateway = parseBoolValue(request->getParam("isClusterGateway", true)->value());
        }
        if (request->hasParam("parentPort", true)) {
            const int v = request->getParam("parentPort", true)->value().toInt();
            if (v >= 1024 && v <= 65535) nodeConfig.parentPort = static_cast<uint16_t>(v);
        }
        if (request->hasParam("siblingPort", true)) {
            const int v = request->getParam("siblingPort", true)->value().toInt();
            if (v >= 1024 && v <= 65535) nodeConfig.siblingPort = static_cast<uint16_t>(v);
        }

        saveNodeConfig(nodeConfig);

        runtimeUdpParentPort = nodeConfig.parentPort;
        runtimeUdpSiblingPort = nodeConfig.siblingPort;
        udpRuntimeEnsureReady(runtimeUdpParentPort, runtimeUdpSiblingPort);
        udpRuntimeResetBeaconState();
        announcePresence();

        JsonDocument doc;
        doc["status"] = "ok";
        auto cluster = doc["cluster"].to<JsonObject>();
        cluster["activeClusterId"] = nodeConfig.activeClusterId;
        cluster["parentHost"] = nodeConfig.parentHost;
        cluster["parentNodeId"] = nodeConfig.parentNodeId;
        cluster["isClusterGateway"] = nodeConfig.isClusterGateway;
        cluster["parentPort"] = nodeConfig.parentPort;
        cluster["siblingPort"] = nodeConfig.siblingPort;
        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    });

    server.on("/node/restart", HTTP_POST, [](AsyncWebServerRequest *request){
        String reason = "api-request";
        if (request->hasParam("reason", true)) {
            reason = request->getParam("reason", true)->value();
        } else if (request->hasParam("reason")) {
            reason = request->getParam("reason")->value();
        }

        int delayMs = 150;
        if (request->hasParam("delayMs", true)) {
            delayMs = request->getParam("delayMs", true)->value().toInt();
        } else if (request->hasParam("delayMs")) {
            delayMs = request->getParam("delayMs")->value().toInt();
        }
        if (delayMs < 0) delayMs = 0;
        if (delayMs > 2000) delayMs = 2000;

        JsonDocument doc;
        doc["status"] = "ok";
        doc["restartRequested"] = true;
        doc["reason"] = reason;
        doc["delayMs"] = delayMs;
        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);

        delay(delayMs);
        ESP.restart();
    });

    // Relay device actions: toggle, turnOn, turnOff.
    server.on("/devices/relay/action", HTTP_POST, [](AsyncWebServerRequest *request){
        String action;
        if (request->hasParam("action", true)) {
            action = request->getParam("action", true)->value();
        } else if (request->hasParam("action")) {
            action = request->getParam("action")->value();
        }
        action.trim();
        if (action.length() == 0) {
            request->send(400, "application/json", "{\"error\":\"action is required\"}");
            return;
        }

        pinMode(relayPinNumber, OUTPUT);
        if (action.equalsIgnoreCase("toggle")) {
            relayStateOn = !relayStateOn;
        } else if (action.equalsIgnoreCase("turnOn")) {
            relayStateOn = true;
        } else if (action.equalsIgnoreCase("turnOff")) {
            relayStateOn = false;
        } else {
            request->send(400, "application/json", "{\"error\":\"unsupported relay action\"}");
            return;
        }

        digitalWrite(relayPinNumber, relayStateOn ? HIGH : LOW);

        JsonDocument doc;
        doc["status"] = "ok";
        doc["device"] = "RELAY";
        doc["action"] = action;
        doc["pin"] = relayPinNumber;
        doc["state"] = relayStateOn ? "on" : "off";
        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    });

