scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
        auto stats = doc["stats"].to<JsonObject>();
        stats["claimAttempts"] = bonecrusherStats.claimAttempts;
        stats["claimed"] = bonecrusherStats.claimed;
        stats["completed"] = bonecrusherStats.completed;
        stats["failed"] = bonecrusherStats.failed;
        stats["requeued"] = bonecrusherStats.requeued;
        stats["deadLettered"] = bonecrusherStats.deadLettered;
        stats["heartbeatsSent"] = bonecrusherStats.heartbeatsSent;
        stats["lastQueueHttpCode"] = bonecrusherStats.lastQueueHttpCode;
        stats["lastEdgeHttpCode"] = bonecrusherStats.lastEdgeHttpCode;
        stats["lastRunMs"] = static_cast<uint32_t>(bonecrusherStats.lastRunMs);
        stats["lastError"] = bonecrusherStats.lastError;

        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    });

    server.on("/bonecrusher/worker/config", HTTP_POST, [](AsyncWebServerRequest *request){
        if (request->hasParam("enabled", true)) {
            bonecrusherConfig.enabled = parseBoolValue(request->getParam("enabled", true)->value());
        }
        if (request->hasParam("queueManagerUrl", true)) {
            bonecrusherConfig.queueManagerUrl = request->getParam("queueManagerUrl", true)->value();
        }
        if (request->hasParam("queueName", true)) {
            bonecrusherConfig.queueName = request->getParam("queueName", true)->value();
        }
        if (request->hasParam("workerId", true)) {
            bonecrusherConfig.workerId = request->getParam("workerId", true)->value();
        }
        if (request->hasParam("leaseMs", true)) {
            bonecrusherConfig.leaseMs = static_cast<uint32_t>(request->getParam("leaseMs", true)->value().toInt());
        }
        if (request->hasParam("pollIntervalMs", true)) {
            bonecrusherConfig.pollIntervalMs = static_cast<uint32_t>(request->getParam("pollIntervalMs", true)->value().toInt());
        }
        if (request->hasParam("heartbeatMs", true)) {
            bonecrusherConfig.heartbeatMs = static_cast<uint32_t>(request->getParam("heartbeatMs", true)->value().toInt());
        }
        if (request->hasParam("processTimeoutMs", true)) {
            bonecrusherConfig.processTimeoutMs = static_cast<uint32_t>(request->getParam("processTimeoutMs", true)->value().toInt());
        }
        if (request->hasParam("retryDelayMs", true)) {
            bonecrusherConfig.retryDelayMs = static_cast<uint32_t>(request->getParam("retryDelayMs", true)->value().toInt());
        }
        if (request->hasParam("maxAttempts", true)) {
            bonecrusherConfig.maxAttempts = static_cast<uint32_t>(request->getParam("maxAttempts", true)->value().toInt());
        }

        if (bonecrusherConfig.workerId.length() == 0) {
            bonecrusherConfig.workerId = nodeName;
        }

        bool persist = true;
        if (request->hasParam("persist", true)) {
            persist = parseBoolValue(request->getParam("persist", true)->value());
        }
        if (persist) {
            saveBonecrusherWorkerConfig();
        }

        JsonDocument doc;
        doc["updated"] = true;
        doc["persisted"] = persist;
        doc["enabled"] = bonecrusherConfig.enabled;
        doc["queueManagerUrl"] = bonecrusherConfig.queueManagerUrl;
        doc["queueName"] = bonecrusherConfig.queueName;
        doc["workerId"] = bonecrusherConfig.workerId;
        doc["leaseMs"] = bonecrusherConfig.leaseMs;
        doc["pollIntervalMs"] = bonecrusherConfig.pollIntervalMs;
        doc["heartbeatMs"] = bonecrusherConfig.heartbeatMs;
        doc["processTimeoutMs"] = bonecrusherConfig.processTimeoutMs;
        doc["retryDelayMs"] = bonecrusherConfig.retryDelayMs;
        doc["maxAttempts"] = bonecrusherConfig.maxAttempts;

        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    });
    #endif

    #ifndef DISABLE_FFS_ROUTES
    registerFFSRoutes(server, federatedFS);
    #endif
#ifdef ENABLE_PMACHINE
#ifndef DISABLE_PMACHINE_ROUTES
    registerPMachineRoutes(server, pm, &federatedFS);
#endif
#endif
    server.onNotFound(notFound);
    
#ifdef ENABLE_CAMERA
    setupCameraRoutes(server);
    Serial.println("[CAMERA] Camera routes registered");
#endif

#ifdef ENABLE_AWS_IOT
    registerAwsIotRoutes(server);
    Serial.println("[AWS_IOT] AWS IoT routes registered");
#endif

#ifdef ENABLE_PRINTER_SCANNER
    registerPrinterRoutes(server);
    Serial.println("[PRINTER] Printer/Scanner routes registered");
#endif

#ifdef ENABLE_BLUETOOTH_DEVICES
#if !defined(DISABLE_BLE_AUDIO_TTS)
    registerBluetoothRoutes(server);
    Serial.println("[BLUETOOTH] Bluetooth routes registered");
#endif
#if defined(ENABLE_BLUETOOTH_AUDIO_TTS)
    if (globalBluetoothAudioTtsService) {
        registerBluetoothAudioTtsRoutes(server, *globalBluetoothAudioTtsService);
        Serial.println("[BLUETOOTH-AUDIO] Bluetooth Audio/TTS routes registered");
    }
#endif
#ifdef ENABLE_EVENT_SCHEDULER
    registerSchedulerRoutes(server);
    Serial.println("[SCHEDULER] Scheduler routes registered");
#endif
#endif

    #ifndef DISABLE_WIFI_PROVISIONING
    registerWiFiProvisioningRoutes(server);
    Serial.println("[WIFI-PROV] WiFi provisioning routes registered");
    #else
    Serial.println("[WIFI-PROV] Disabled by build flag");
    #endif
    
    server.begin();
}


#define ANNOUNCE_INTERVAL 10000 // ms
#define WIFI_RECONNECT_INTERVAL 5000 // ms

constexpr uint16_t DEFAULT_UDP_PARENT_PORT = 4210;
constexpr uint16_t DEFAULT_UDP_SIBLING_PORT = 4211;
constexpr unsigned long TOPOLOGY_SYNC_INTERVAL_MS = 60000;

uint16_t runtimeUdpParentPort = DEFAULT_UDP_PARENT_PORT;
uint16_t runtimeUdpSiblingPort = DEFAULT_UDP_SIBLING_PORT;
unsigned long lastTopologySyncMs = 0;

unsigned long lastAnnounce = 0;

#if 0 // UDP announcement and discovery disabled
#define ANNOUNCE_PORT 4210
#define ANNOUNCE_INTERVAL 10000 // ms
WiFiUDP udp;
unsigned long lastAnnounce = 0;
void processIncomingUDP() {
    int packetSize = udp.parsePacket();
    if (packetSize) {
        char incoming[128];
        int len = udp.read(incoming, sizeof(incoming) - 1);
        if (len > 0) {
            incoming[len] = 0;
            Serial.print("Received UDP announcement: ");
            Serial.println(incoming);
            // ...existing code for processing announcement...
        }
    }
}
void announcePresence() {
    String msg = nodeName + "," + WiFi.macAddress() + "," + WiFi.localIP().toString();
    udp.beginPacket("255.255.255.255", ANNOUNCE_PORT);
    udp.write((const uint8_t*)msg.c_str(), msg.length());
    udp.endPacket();
}
#endif

void announcePresence() {
    if (!udpRuntimeEnsureReady(runtimeUdpParentPort, runtimeUdpSiblingPort)) {
        return;
    }

