scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
    Serial.begin(115200);
    delay(100);
    Serial.println("[BOOT] setup() starting...");

    // 1. Mount filesystem (SD or LittleFS)
#if defined(ESP32)
    bool sdAvailable = false;
    if (SD.begin()) {
        Serial.println("SD card detected and mounted");
        sdAvailable = true;
    } else {
        Serial.println("No SD card detected, falling back to LittleFS");
    }
    if (!sdAvailable) {
        if (!ensureLittleFsInitialized()) {
            Serial.println("LittleFS mount failed");
            while (1) delay(1000);
        }
    }
#else
    if (!ensureLittleFsInitialized()) {
        Serial.println("LittleFS mount failed");
        while (1) delay(1000);
    }
#endif

#if defined(ESP32)
    if (!ensureLittleFsInitialized()) {
        Serial.println("LittleFS unavailable");
        while (1) delay(1000);
    }
#endif

    // 2. WiFi connection logic
    Serial.println("[BOOT] Connecting to WiFi...");
    WiFi.mode(WIFI_STA);
    WiFi.setAutoReconnect(true);
    WiFi.persistent(false);
    String wifiSsid = wifiConfig.ssid.length() ? wifiConfig.ssid : "Home";
    String wifiPassword = wifiConfig.password.length() ? wifiConfig.password : "Brady123";
    WiFi.begin(wifiSsid.c_str(), wifiPassword.c_str());
    udpRuntimeConfigureWifiCredentials(wifiSsid, wifiPassword);
    int retries = 0;
    while (WiFi.status() != WL_CONNECTED && retries < 30) {
        delay(500);
        Serial.print(".");
        retries++;
    }
    Serial.println();
    if (WiFi.status() == WL_CONNECTED) {
        Serial.print("[BOOT] WiFi connected: ");
        Serial.println(WiFi.localIP());
    } else {
        Serial.println("[BOOT] WiFi connection failed");
    }

    // 3. Ensure /devices, /services, and /flows directories exist at root at boot
    File root = LittleFS.open("/", "r");
    bool foundDevices = false, foundServices = false, foundFlows = false;
    Serial.println("Looking for services and devices");
    if (root && root.isDirectory()) {
        File entry = root.openNextFile();
        while (entry) {
            String name = String(entry.name());
            if (entry.isDirectory()) {
                if (name == "/devices") foundDevices = true;
                if (name == "/services") foundServices = true;
                if (name == "/flows") foundFlows = true;
            }
            entry = root.openNextFile();
        }
        root.close();
    }
    Serial.println("Making sure we have devices and services");
    if (!foundDevices) LittleFS.mkdir("/devices");
    if (!foundServices) LittleFS.mkdir("/services");
    if (!foundFlows) LittleFS.mkdir("/flows");
    ensureDocsTreeAndDefaults();

    // 4. LEDPIN device creation after WiFi connection and directory creation
    Serial.println("[DEBUG] Checking WiFi status for LEDPIN device creation...");
    if (WiFi.status() == WL_CONNECTED) {
        Serial.println("[LEDPIN] Creating /devices/LEDPIN.json after WiFi connection...");
        if (LittleFS.exists("/devices")) {
            File f = LittleFS.open("/devices/LEDPIN.json", "w");
            if (f) {
                JsonDocument doc;
                doc["type"] = "device";
                doc["name"] = "LEDPIN";
                doc["pin"] = 2;
                auto arr = doc["actions"].to<JsonArray>();
                arr.add("set_output");
                arr.add("raise");
                arr.add("lower");
                String json;
                serializeJson(doc, json);
                f.print(json);
                f.close();
                Serial.println("[LEDPIN] /devices/LEDPIN.json created.");
            } else {
                Serial.println("[LEDPIN] Failed to create /devices/LEDPIN.json!");
            }
            pinMode(2, OUTPUT);
            digitalWrite(2, LOW);
            Serial.println("[LEDPIN] Pin 2 set as OUTPUT and LOW (LED off)");

            File relayFile = LittleFS.open("/devices/RELAY.json", "w");
            if (relayFile) {
                JsonDocument relayDoc;
                relayDoc["type"] = "device";
                relayDoc["name"] = "RELAY";
                relayDoc["pin"] = relayPinNumber;
                relayDoc["visibility"] = "private";
                auto relayActions = relayDoc["actions"].to<JsonArray>();
                relayActions.add("toggle");
                relayActions.add("turnOn");
                relayActions.add("turnOff");
                auto relayFsm = relayDoc["fsm"].to<JsonObject>();
                relayFsm["initialState"] = "off";
                auto relayStates = relayFsm["states"].to<JsonArray>();
                relayStates.add("off");
                relayStates.add("on");
                auto relayTransitions = relayFsm["transitions"].to<JsonArray>();
                JsonObject t1 = relayTransitions.add<JsonObject>();
                t1["from"] = "off";
                t1["action"] = "turnOn";
                t1["to"] = "on";
                JsonObject t2 = relayTransitions.add<JsonObject>();
                t2["from"] = "on";
                t2["action"] = "turnOff";
                t2["to"] = "off";
                JsonObject t3 = relayTransitions.add<JsonObject>();
                t3["from"] = "off";
                t3["action"] = "toggle";
                t3["to"] = "on";
                JsonObject t4 = relayTransitions.add<JsonObject>();
                t4["from"] = "on";
                t4["action"] = "toggle";
                t4["to"] = "off";
                String relayJson;
                serializeJson(relayDoc, relayJson);
                relayFile.print(relayJson);
                relayFile.close();
                Serial.println("[RELAY] /devices/RELAY.json created.");
            } else {
                Serial.println("[RELAY] Failed to create /devices/RELAY.json!");
            }

            pinMode(relayPinNumber, OUTPUT);
            relayStateOn = false;
            digitalWrite(relayPinNumber, LOW);
            Serial.printf("[RELAY] Pin %d set as OUTPUT and LOW (relay off)\n", relayPinNumber);
        } else {
            Serial.println("[LEDPIN] /devices directory does NOT exist!");
        }
    } else {
        Serial.println("[LEDPIN] WiFi not connected, skipping LEDPIN device creation!");
    }

    // 5. Load node config from /ffs/.NodeConfig.json if present
    if (loadNodeConfig(nodeConfig) && nodeConfig.nodeName.length()) {
        nodeName = nodeConfig.nodeName;
    } else {
        // Fallback: Load node name if exists
        File f = LittleFS.open(NODE_NAME_PATH, "r");
        if (f) {
            nodeName = f.readString();
            f.close();
        }
        // Append last 4 hex digits of MAC for uniqueness
        uint8_t mac[6];
        WiFi.macAddress(mac);
        char macSuffix[5];
        sprintf(macSuffix, "%02X%02X", mac[4], mac[5]);
        nodeName += "-";
        nodeName += macSuffix;
    }

    #ifndef DISABLE_BONECRUSHER
    initializeBonecrusherWorkerDefaults();
    loadBonecrusherWorkerConfig();
    if (bonecrusherConfig.workerId.length() == 0) {
        bonecrusherConfig.workerId = nodeName;
    }
    #endif

    // 6. Set hostname, start UDP, and announce presence (must be after WiFi is up and nodeName is set)
    WiFi.setHostname(nodeName.c_str());
    Serial.println("[OTA] Removed: use serial firmware upload + FFS file upload for delivery");
    configureSupervisorTargets();
    loadSupervisorConfig();
    if (isSupervisorRole()) {
        Serial.println("[SUPERVISOR] Sentinel role enabled");
        Serial.print("[SUPERVISOR] require frontend for green: ");
        Serial.println(supervisorRequireFrontend ? "true" : "false");
        Serial.print("[SUPERVISOR] backend target: ");
        Serial.println(supervisorBackendProbe.url);
        Serial.print("[SUPERVISOR] frontend target: ");
        Serial.println(supervisorFrontendProbe.url);
        Serial.print("[SUPERVISOR] heartbeat target: ");
        Serial.println(supervisorHeartbeatUrl);
    }
    udpRuntimeEnsureReady(runtimeUdpParentPort, runtimeUdpSiblingPort);
    udpRuntimeResetBeaconState();
    announcePresence();

#ifdef ENABLE_TIME_AUTHORITY
    timeAuthorityBegin(nodeName);
#endif

#ifndef DISABLE_UNIQUE_ID_SERVICE
    uniqueIdBegin(nodeName);
#endif

    // 7. Initialize FederatedFileSystem with SD if available, else LittleFS
#if defined(ESP32)
    if (sdAvailable) {
        ffsUp = federatedFS.begin(FFSBackend::SD, SD);
        if (ffsUp) {
            Serial.println("FederatedFileSystem is UP (SD backend)");
        } else {
            Serial.println("FederatedFileSystem failed to initialize SD");
        }
    } else {
        ffsUp = federatedFS.begin(FFSBackend::LittleFS, LittleFS);
        if (ffsUp) {
            Serial.println("FederatedFileSystem is UP (LittleFS backend)");
        } else {
            Serial.println("FederatedFileSystem failed to initialize LittleFS");
        }
    }
#else
    ffsUp = federatedFS.begin(FFSBackend::LittleFS, LittleFS);
    if (ffsUp) {
        Serial.println("FederatedFileSystem is UP (LittleFS backend)");
    } else {
        Serial.println("FederatedFileSystem failed to initialize LittleFS");
    }
#endif

#ifdef ENABLE_PMACHINE
    pm.setFFS(&federatedFS);
#endif

#ifdef ENABLE_CAMERA
    Serial.println("[BOOT] Initializing camera service...");
    CameraConfig cameraConfig = CameraService::getDefaultConfig();
#if defined(ENABLE_DOORBELL_CAMERA)
    cameraConfig.resolution = RES_QVGA;
    cameraConfig.quality = QUALITY_MEDIUM;
#else
    cameraConfig.resolution = RES_SVGA;
    cameraConfig.quality = QUALITY_MEDIUM;
#endif
    
    if (cameraService.begin(cameraConfig)) {
        Serial.println("[CAMERA] Camera initialized successfully");
        cameraService.setFFS(&federatedFS);
#if defined(ENABLE_DOORBELL_CAMERA)
        pinMode(DOORBELL_BUTTON_PIN, INPUT_PULLUP);
        doorbellButtonLastReading = digitalRead(DOORBELL_BUTTON_PIN) == DOORBELL_BUTTON_ACTIVE_LEVEL;
        doorbellButtonStablePressed = doorbellButtonLastReading;
        doorbellButtonLastChangeMs = millis();

        MotionDetectionConfig motionConfig;
        motionConfig.enabled = true;
        motionConfig.threshold = 20;
        motionConfig.minBlocks = 10;
        motionConfig.blockSize = 16;
        motionConfig.cooldownMs = 1500;
        if (cameraService.enableMotionDetection(motionConfig)) {
            cameraService.setMotionCallback(onDoorbellMotionDetected);
            Serial.println("[DOORBELL] Motion detection enabled");
        } else {
            Serial.println("[DOORBELL] Motion detection failed to start");
        }
#endif
    } else {
        Serial.println("[CAMERA] Camera initialization failed");
    }
#endif

