scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
#ifdef ENABLE_AWS_IOT
    // Update AWS IoT Gateway (process MQTT messages)
    updateAwsIotGateway();
#endif

#ifdef ENABLE_BLUETOOTH_DEVICES
    // Update Bluetooth service (handle scanning and device discovery)
#if !defined(DISABLE_BLE_AUDIO_TTS)
    if (globalBluetoothService) {
        globalBluetoothService->loop();
    }
#endif
#if defined(ENABLE_BLUETOOTH_AUDIO_TTS)
    if (globalBluetoothAudioTtsService) {
        globalBluetoothAudioTtsService->loop();
    }
#endif
#endif

#ifdef ENABLE_EVENT_SCHEDULER
    // Update Event Scheduler (check and execute scheduled events)
    if (globalEventScheduler) {
        globalEventScheduler->loop();
    }
#endif

    // Non-blocking UDP receive for node discovery
    UdpRuntimeContext udpContext;
    udpContext.nodeName = nodeName.c_str();
    udpContext.deviceRole = deviceRole;
    udpContext.firmwareVersion = firmwareVersion;
    udpContext.firmwareBuildStamp = firmwareBuildStamp;
    udpContext.firmwareTrack = firmwareTrack;
    udpContext.discoveredNodeTable = &discoveredNodeTable;
    udpContext.computeNodeCapabilityHash = computeNodeCapabilityHash;
#if defined(ENABLE_DOORBELL_DISPLAY)
    udpContext.onAlertMessage = handleDoorbellAlertPacket;
#endif
    udpRuntimeProcessIncoming(udpContext, runtimeUdpParentPort, runtimeUdpSiblingPort);
        /* UDP announcement disabled */
        // processIncomingUDP();

#if defined(ENABLE_DOORBELL_CAMERA)
    pollDoorbellButton();
    if (millis() - doorbellLastMotionCheckMs > 500) {
        MotionEvent motionEvent;
        if (cameraService.checkMotion(motionEvent)) {
            Serial.printf("[DOORBELL] Person alert: %d blocks changed (%.1f%%)\n",
                          motionEvent.changedBlocks, motionEvent.changePercentage);
        }
        doorbellLastMotionCheckMs = millis();
    }
#endif

    // Remove nodes not seen in last 10 minutes (600000 ms)
    unsigned long now = millis();
    for (auto it = discoveredNodeTable.begin(); it != discoveredNodeTable.end(); ) {
        if (now - it->second.lastSeen > 600000) {
            Serial.print("Node expired: ");
            Serial.println(it->second.mac);
            it = discoveredNodeTable.erase(it);
        } else {
            ++it;
        }
    }

    const unsigned long beaconInterval = udpRuntimeGetBeaconIntervalMs(
        NODE_BEACON_ACKED_INTERVAL_MS,
        NODE_BEACON_UNACKED_INTERVAL_MS);
    if (millis() - lastAnnounce > beaconInterval) {
        if (!isBonecrusherRole()) {
            announcePresence();
        }
        lastAnnounce = millis();
    }

    if (millis() - lastTopologySyncMs > TOPOLOGY_SYNC_INTERVAL_MS) {
        if (!isBonecrusherRole()) {
            syncTopologyUdpPortsFromAggregator();
        }
        lastTopologySyncMs = millis();
    }

    runSupervisorHealthChecks();
    
#ifdef ENABLE_DISPLAY
    // Update LVGL (handles rendering and touch)
    displayService.update();
#endif

#ifdef ENABLE_PRINTER_SCANNER
    // Update printer/scanner service
    if (globalPrinterService) {
        globalPrinterService->loop();
    }
#endif
    // No need for server.handleClient() with AsyncWebServer
    // Add VM logic here
}

